# IsFPatByClass

## Description
Function IsFPatByClass whether a class fill pattern is used for the referenced object.

```pascal
FUNCTION IsFPatByClass(h : HANDLE): BOOLEAN;
```

```python
def vs.IsFPatByClass(h):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to object.|

## Remarks
Returns an indication of whether the class fill pattern is used for the object referenced by h.
[sd  8/19/98]

## Version
Availability: from VectorWorks8.0

## Category
* Object Attributes